; domain
(define (domain progetto)
    (:requirements :strips :typing :disjunctive-preconditions :negative-preconditions :action-costs :equality)

    (:types
        cell - object
        tile - object
        tile_3 tile_5 tile_6 tile_7 tile_9 tile_a tile_b tile_c tile_d tile_e tile_f - tile
        debt - object
    )

    (:predicates
        ; per creare la griglia
        (is_above ?c1 - cell ?c2 - cell)
        (is_right ?c1 - cell ?c2 - cell)

        (has_silver ?c - cell)

        ; per indicare quali tile sono gia' state usate
        (used ?t - tile)

        (has_debt ?d - debt)

        ; per ridurre la complessita' delle precondizioni - senza questo predicato non funziona
        (has_tile ?c - cell)

        (open_left ?c - cell)
        (open_right ?c - cell)
        (open_above ?c - cell)
        (open_below ?c - cell)


        ; per indicare se abbiamo messo la prima tile
        (first_tile_positioned)

    )

    (:functions
        (total-cost)
    )


    ;############################################### TILE 3 ###############################################

    (:action place_tile_3
        :parameters (?c - cell ?t - tile_3 ?d - debt)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a dx o a sx ci deve essere o un oro o una tile,
            ; e se c'e' una tile a sx deve essere di tipo: { 3, 5, 7, 9, b, d, f }, se c'e' una tile a dx
            ; deve essere di tipo { 3, 6, 7, a, b, e, f }
                         
            (not (has_debt ?d))

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))
            
            ; deve esserci almeno una cella c2 a dx o a sx con un oro o una tile
            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))

                ; oppure c'e' una cella o a dx o a sx che ha una tile, e se ci sono celle a dx o sx con tile
                ; devono essere tile appropriate
            
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_right ?c ?c2)
                            (open_right ?c2)
                        )
                        (and
                            (is_right ?c2 ?c)
                            (open_left ?c2)
                        )
                        
                    )
                        
                        
                )
                    ; se una cella c2 e' a dx o a sx e ha una tile, deve essere appropriata
                
            )

        )

        :effect (and
        
            (has_tile ?c)
            (open_right ?c)
            (open_left ?c)

            (has_debt ?d)
            
            ; t e' usata
            (used ?t)


            ; segna che abbiamo messo (almeno) una tile
            (first_tile_positioned)


            (increase (total-cost) 6)
        )

    )

    


    ;############################################### TILE 5 ###############################################

    (:action place_tile_5
        :parameters (?c - cell ?t - tile_5 ?d - debt)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella a dx o sotto ci deve essere o un oro o una tile,
            ; e se c'e' una tile a dx deve essere di tipo: { 3, 6, 7, a, b, e, f }, se c'e' una tile sotto
            ; deve essere di tipo { 9, a, b, c, d, e, f }

            (not (has_debt ?d))

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))


            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))

               
                ; deve esserci almeno una cella c2 a dx o sotto con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_right ?c2 ?c)
                            (open_left ?c2)  
                        )
                        (and
                            (is_above ?c ?c2)
                            (open_above ?c2)
                        )
                        
                        
                    )
                        
                        
                )

              
            )
        )

        :effect (and
            ; c'e' la tile t su c

            (has_debt ?d)
            
            (has_tile ?c)
            (open_below ?c)
            (open_right ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

             

            (increase (total-cost) 2)       
        )
    )



    ;############################################### TILE 6 ###############################################

    (:action place_tile_6
        :parameters (?c - cell ?t - tile_6 ?d - debt)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella a sx o sotto ci deve essere o un oro o una tile,
            ; e se c'e' una tile a sx deve essere di tipo: { 3, 5, 7, 9, b, d, f }, se c'e' una tile sotto
            ; deve essere di tipo { 9, a, b, c, d, e, f }

            (not (has_debt ?d))

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))
            

            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))

                
                    ; deve esserci almeno una cella c2 a sx o sotto con un oro o una tile
                (exists (?c2 - cell)
                
                    (or
                        (and
                            (is_right ?c ?c2)                     
                            (open_right ?c2)
                        )
                        (and
                            (is_above ?c ?c2)
                            (open_above ?c2)
                        )
                        
                    )
                        
                )
                   
                
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_below ?c)
            (open_left ?c)

            (has_debt ?d)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

             
            (increase (total-cost) 2)
            
        )
    )



    ;############################################### TILE 7 ###############################################


    (:action place_tile_7
        :parameters (?c - cell ?t - tile_7 ?d - debt)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a sx o dx o sotto ci deve essere o un oro o una tile,
            ; e se c'e' una tile a dx deve essere di tipo: { 3, 6, 7, a, b, e, f }, se c'e' una tile sotto
            ; deve essere di tipo { 9, a, b, c, d, e, f }, se c'e' una tile a sx deve essere di tipo:
            ; { 3, 5, 7, 9, b, d, f }

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))

            (not (has_debt ?d))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))
    
            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))

               
                    ; deve esserci almeno una cella c2 a sx o dx o sotto con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_right ?c ?c2)     
                            (open_right ?c2)                     
                        )
                        (and
                            (is_right ?c2 ?c)
                            (open_left ?c2)
                        )
                        (and
                            (is_above ?c ?c2)
                            (open_above ?c2)
                        )
                        
                        
                        
                    )
                        
                )
                    ; o a sx o dx o sotto ci deve essere un oro o una tile
                  
            )
        )

        :effect (and
            ; c'e' la tile t su c

            (has_debt ?d)
            
            (has_tile ?c)
            (open_below ?c)
            (open_left ?c)
            (open_right ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

             

            (increase (total-cost) 8)
        )
    )


    
    ;############################################### TILE 9 ###############################################


    (:action place_tile_9
        :parameters (?c - cell ?t - tile_9 ?d - debt)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a dx o sopra ci deve essere o un oro o una tile,
            ; e se c'e' una tile a dx deve essere di tipo: { 3, 6, 7, a, b, e, f }, se c'e' una tile sopra
            ; deve essere: { 5, 6, 7, c, d, e, f }

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))

            (not (has_debt ?d))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))
            

            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))

                
                    ; deve esserci almeno una cella c2 a dx o sopra con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or

                        (and
                            (is_right ?c2 ?c)
                            (open_left ?c2)
                        )
                        (and
                            (is_above ?c2 ?c)
                            (open_below ?c2)
                        )
                        
                    )
                    
                )
                    ; o a dx o sopra ci deve essere un oro o una tile
                   
                
            )
        )

        :effect (and
            ; c'e' la tile t su c

            (has_debt ?d)
            
            (has_tile ?c)
            (open_above ?c)
            (open_right ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

            (increase (total-cost) 2)
        )
    )


    
    ;############################################### TILE A ###############################################

    (:action place_tile_a
        :parameters (?c - cell ?t - tile_a ?d - debt)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a sx o sopra ci deve essere o un oro o una tile,
            ; e se c'e' una tile a sx deve essere di tipo:
            ; { 3, 5, 7, 9, b, d, f }, se c'e' una tile sopra deve essere: { 5, 6, 7, c, d, e, f }

            (not (has_debt ?d))

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))

            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))

                
                    ; deve esserci almeno una cella c2 a sx o sopra con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_right ?c ?c2)
                            (open_right ?c2)
                        )
                        (and
                            (is_above ?c2 ?c)
                            (open_below ?c2)
                        )
                        
                    )
                        
                )
                    ; o a sx o sopra ci deve essere un oro o una tile
                    
                
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_above ?c)
            (open_left ?c)

            (has_debt ?d)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

            (increase (total-cost) 2)
        )
    )



    
    ;############################################### TILE B ###############################################


    (:action place_tile_b
        :parameters (?c - cell ?t - tile_b ?d - debt)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a sx o dx o sopra ci deve essere o un oro o una tile,
            ; e se c'e' una tile a dx deve essere di tipo: { 3, 6, 7, a, b, e, f }, se c'e' una tile a sx deve essere
            ; di tipo: { 3, 5, 7, 9, b, d, f }, se c'e' una tile sopra deve essere: { 5, 6, 7, c, d, e, f }

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))

            (not (has_debt ?d))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))

            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))
            
               
                    ; deve esserci almeno una cella c2 a sx o dx o sopra con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_right ?c ?c2)
                            (open_right ?c2)
                        )
                        (and
                            (is_right ?c2 ?c)
                            (open_left ?c2)
                        )
                        (and
                            (is_above ?c2 ?c)
                            (open_below ?c2)
                        )
                        
                            
                    )
                        
                )
                    ; o a sx o dx o sopra ci deve essere un oro o una tile
                   
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_left ?c)
            (open_right ?c)
            (open_above ?c)

            (has_debt ?d)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

             
            (increase (total-cost) 8)
           
        )
    )



    
    ;############################################### TILE C ###############################################

    (:action place_tile_c
        :parameters (?c - cell ?t - tile_c ?d - debt)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o sotto o sopra ci deve essere o un oro o una tile,
            ; e se c'e' una tile sotto deve essere di tipo { 9, a, b, c, d, e, f }, se c'e' una tile sopra
            ; deve essere: { 5, 6, 7, c, d, e, f }


            (not (has_debt ?d))

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))

            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))
            
               
                    ; deve esserci almeno una cella sopra o sotto con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_above ?c2 ?c)
                            (open_below ?c2)
                        )
                        (and
                            (is_above ?c ?c2)
                            (open_above ?c2)
                        )
                        
                        
                    )
                        
                )
                    ; su ogni cella o sotto o sopra ci deve essere un oro o una tile appropriata
                    
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_above ?c)
            (open_below ?c)

            (has_debt ?d)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

             
            (increase (total-cost) 6)
            
        )
    )


    
    ;############################################### TILE D ###############################################


    (:action place_tile_d
        :parameters (?c - cell ?t - tile_d ?d - debt)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a dx o sotto o sopra ci deve essere o un oro o una tile,
            ; e se c'e' una tile a dx deve essere di tipo: { 3, 6, 7, a, b, e, f }, se c'e' una tile sotto
            ; deve essere di tipo { 9, a, b, c, d, e, f }, se c'e' una tile sopra deve essere: { 5, 6, 7, c, d, e, f }

            (not (has_debt ?d))

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))

            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))
            
                
                    ; deve esserci almeno una cella a dx o sopra o sotto con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_right ?c2 ?c)
                            (open_left ?c2)
                        )
                        (and
                            (is_above ?c2 ?c)
                            (open_below ?c2)
                        )
                        (and
                            (is_above ?c ?c2)
                            (open_above ?c2)
                        )
                        
                        
                    )
                            
                )
                    ; o a dx o sotto o sopra ci deve essere un oro o una tile
                    
                       
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_below ?c)
            (open_above ?c)
            (open_right ?c)

            (has_debt ?d)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

            (increase (total-cost) 8)
           
        )
    )


    
    ;############################################### TILE E ###############################################

    
    (:action place_tile_e
        :parameters (?c - cell ?t - tile_e ?d - debt)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a sx o sotto o sopra ci deve essere o un oro o una tile,
            ; e se c'e' una tile sotto deve essere di tipo { 9, a, b, c, d, e, f }, se c'e' una tile a sx deve essere
            ; di tipo: { 3, 5, 7, 9, b, d, f }, se c'e' una tile sopra deve essere: { 5, 6, 7, c, d, e, f }

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))

            (not (has_debt ?d))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))


            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))
            
                
                ; deve esserci almeno una cella a sx o sopra o sotto con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_right ?c ?c2)
                            (open_right ?c2)
                        )
                        (and
                            (is_above ?c2 ?c)
                            (open_below ?c2)
                        )
                        (and
                            (is_above ?c ?c2)
                            (open_above ?c2)
                        )
                        
                        
                        
                    )
                            
                )

                    ; o a sx o dx o sotto o sopra ci deve essere un oro o una tile
                   
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_left ?c)
            (open_above ?c)
            (open_below ?c)

            (has_debt ?d)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

             
            (increase (total-cost) 8)   
            
        )
    )



    
    ;############################################### TILE F ###############################################


    (:action place_tile_f
        :parameters (?c - cell ?t - tile_f ?d - debt)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a sx o dx o sotto o sopra ci deve essere o un oro o una tile,
            ; e se c'e' una tile a dx deve essere di tipo: { 3, 6, 7, a, b, e, f }, se c'e' una tile sotto
            ; deve essere di tipo { 9, a, b, c, d, e, f }, se c'e' una tile a sx deve essere di tipo:
            ; { 3, 5, 7, 9, b, d, f }, se c'e' una tile sopra deve essere: { 5, 6, 7, c, d, e, f }


            (not (has_debt ?d))

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))


            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))
            
                
                    ; deve esserci almeno una cella a sx o dx o sopra o sotto con un oro o una tile
                (exists (?c2 - cell)
                
                    (or
                        (and
                            (is_right ?c ?c2)
                            (open_right ?c2)
                        )
                        (and
                            (is_right ?c2 ?c)
                            (open_left ?c2)
                        )
                        (and
                            (is_above ?c2 ?c)
                            (open_below ?c2)
                        )
                        (and
                            (is_above ?c ?c2)
                            (open_above ?c2)
                        )
                        
                        
                    )
                            
                )
                ; o a sx o dx o sotto o sopra ci deve essere un oro o una tile
                   
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_above ?c)
            (open_below ?c)
            (open_left ?c)
            (open_right ?c)

            (has_debt ?d)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

            (increase (total-cost) 15)

        )
    )


    ;############################################### ALTRO ###############################################


    (:action take_silver
        :parameters (?c - cell ?d1 ?d2 ?d3 - debt)
        
        :precondition (and
            (has_silver ?c)
            (has_tile ?c)
            (not (= ?d1 ?d2))
            (not (= ?d3 ?d2))
            (not (= ?d3 ?d1))
            (has_debt ?d1)
            (has_debt ?d2)
            (has_debt ?d3)
        )

        :effect (and
            ; hai preso l'argento e i token
            (not (has_silver ?c))
            (not (has_debt ?d1))
            (not (has_debt ?d2))
            (not (has_debt ?d3))
        )
    )

    (:action pay_debt
        :parameters (?d - debt)
        
        :precondition (and
            (has_debt ?d)
        )

        :effect (and
            (not (has_debt ?d))
            (increase (total-cost) 1)
        )
    )

)

; problem
(define (problem problem7)
	(:domain progetto)
	(:objects
		c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 c16 c17 c18 c19 c20 c21 c22 c23 c24 c25 - cell
		t3_1 t3_2 t3_3 t3_4 - tile_3
		t6_1 - tile_6
		t9_1 - tile_9
		ta_1 - tile_a
		tb_1 - tile_b
		tc_1 - tile_c
		te_1 te_2 te_3 - tile_e
		tf_1 - tile_f
		d1 d2 d3 d4 d5 d6 d7 d8 d9 d10 d11 d12 d13 - debt
	)
	(:init
		(is_above c1 c6)
		(is_above c2 c7)
		(is_above c3 c8)
		(is_above c4 c9)
		(is_above c5 c10)
		(is_above c6 c11)
		(is_above c7 c12)
		(is_above c8 c13)
		(is_above c9 c14)
		(is_above c10 c15)
		(is_above c11 c16)
		(is_above c12 c17)
		(is_above c13 c18)
		(is_above c14 c19)
		(is_above c15 c20)
		(is_above c16 c21)
		(is_above c17 c22)
		(is_above c18 c23)
		(is_above c19 c24)
		(is_above c20 c25)

		(is_right c2 c1)
		(is_right c3 c2)
		(is_right c4 c3)
		(is_right c5 c4)
		(is_right c7 c6)
		(is_right c8 c7)
		(is_right c9 c8)
		(is_right c10 c9)
		(is_right c12 c11)
		(is_right c13 c12)
		(is_right c14 c13)
		(is_right c15 c14)
		(is_right c17 c16)
		(is_right c18 c17)
		(is_right c19 c18)
		(is_right c20 c19)
		(is_right c22 c21)
		(is_right c23 c22)
		(is_right c24 c23)
		(is_right c25 c24)

		(has_tile c7)
		(open_left c7)
		(open_above c7)
		(open_below c7)
		(open_right c7)

		(has_silver c15)
		(has_silver c23)

		(= (total-cost) 0)
	)
	(:goal
		(and
			(has_tile c7)
			(has_tile c19)
			(not (has_debt d1))
			(not (has_debt d2))
			(not (has_debt d3))
			(not (has_debt d4))
			(not (has_debt d5))
			(not (has_debt d6))
			(not (has_debt d7))
			(not (has_debt d8))
			(not (has_debt d9))
			(not (has_debt d10))
			(not (has_debt d11))
			(not (has_debt d12))
			(not (has_debt d13))
		)
	)
	(:metric
		minimize (total-cost)
	)
)

; plan
1. (place_tile_6 c8 t6_1 d1)
   added: (has_tile c8) (open_below c8) (open_left c8) (has_debt d1) (used t6_1) (first_tile_positioned)
   goals met: 13 of 15
2. (place_tile_c c13 tc_1 d10)
   added: (has_tile c13) (open_above c13) (open_below c13) (has_debt d10) (used tc_1)
   goals met: 12 of 15
3. (place_tile_9 c18 t9_1 d11)
   added: (has_debt d11) (has_tile c18) (open_above c18) (open_right c18) (used t9_1)
   goals met: 11 of 15
4. (place_tile_a c19 ta_1 d12)
   added: (has_tile c19) (open_above c19) (open_left c19) (has_debt d12) (used ta_1)
   goals met: 11 of 15
5. (pay_debt d1)
   deleted: (has_debt d1)
   goals met: 12 of 15
6. (pay_debt d10)
   deleted: (has_debt d10)
   goals met: 13 of 15
7. (pay_debt d11)
   deleted: (has_debt d11)
   goals met: 14 of 15
8. (pay_debt d12)
   deleted: (has_debt d12)
   goals met: 15 of 15
